<template>
    <div>
        <carousel :per-page="1" paginationActiveColor="#42b983" paginationColor="#b2ebd1" :paginationSize="12">
            <slide class="slide">
                <div class="container">
                    <h2>Актуальность работы.</h2>
                    <p>
                        <b>Текущая ситуация с публикуемой аэронавигационной информацией (АНИ) в России не отвечает
                            требованиям безопасности полетов.</b> Из года в год на всевозможных конференциях, семинарах,
                        совещаниях, заседаниях и пр. представители авиакомпаний говорят о крайне низком уровне
                        аэронавигационного обеспечения полетов в России.
                    </p>
                    <p>
                        Аэронавигационная информация является важнейшим элементом аэронавигационного
                        обеспечения полетов. Она используется при создании аэронавигационного оборудования воздушных
                        судов, при
                        эксплуатации этого оборудования, как основы аэронавигации, для решения задач использования
                        воздушного
                        пространства и УВД, создания сборников аэронавигационной информации и карт, а также выполнения
                        ряда
                        других задач.
                    </p>
                    <p>
                        Переход на современные информационные безбумажные технологии обеспечения аэронавигационной
                        информацией
                        различных пользователей АНИ, в том числе и полетов воздушных судов, оснащенных комплексом
                        пилотажно-навигационного цифрового оборудования, вызывает необходимость создания перспективных
                        требований к аэронавигационным данным.
                    </p>
                    <p>
                        Создание системы сбора, хранения и распространения аэронавигационных данных позволит
                        более
                        эффективно
                        использовать их в существующих технологиях обеспечения АНИ различных пользователей, а также
                        будет
                        способствовать автоматизации этого процесса, позволяя осуществить взаимодействие на
                        информационном и
                        техническом уровнях с другими системами обеспечения полетов ГА, которые широко
                        эксплуатируются в
                        настоящее время в отрасли или находятся в стадии разработки, а также с зарубежными банками
                        данных АНИ.
                    </p>
                     <p>
                         Создание распределенной системы сбора, хранения и распространения аэронавигационных данных на
                         базе глобальных сетевых технологий решает выдвинутые задачи и результат совпадает с изменениями
                         подготовленными Росаэронавигацией (Росавиацией) 20 августа 2007 г. одобрены на заседании
                         Комиссии Правительства Российской Федерации по законопроектной деятельности.
                     </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <b>Предметом исследования</b> является обеспечение требуемого качества аэронавигационных
                        данных за счет перехода с бумажных технологий на электронные.
                    </p>
                    <p>
                        <b>Объектом исследования</b> в диссертационной работе является процесс циркуляции
                        аэронавигационных данных (АНД) в целом, а также существующая сегодня в России Служба
                        аэронавигационной информации – САИ РФ.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <b>Целью</b> диссертационной работы является оптимизация производственных процессов АНД
                        на основе моделирования распределенной системы сбора, хранения, распространения
                        аэронавигационных данных на базе глобальных сетевых технологий.
                    </p>
                    <p>
                        Для достижения поставленной цели в ходе исследования необходимо решить следующие основные
                        задачи:
                    </p>
                    <ul>
                        <li>провести анализ современного состояния и перспектив развития аэронавигационного обеспечения
                            в общем и служб аэронавигационной информации (САИ) в частности;
                        </li>
                        <li>исследовать форматы и технологии сбора, обработки, хранения и распространения
                            аэронавигационной
                            информации в процессе её циркуляции на различных этапах;
                        </li>
                        <li>исследовать технологии и методы организации циркуляции аэронавигационных данных в электроном
                            виде;
                        </li>
                        <li>исследовать работу узлов обработки аэронавигационных данных, как основных элементов,
                            влияющих на показатели качества обслуживания при передаче аэронавигационных информации;
                        </li>
                        <li>разработать модель комплексной системы сбора, хранения и предоставления аэронавигационных
                            данных;
                        </li>
                        <li>на основе разработанной модели предложить методы оптимизации существующей системы.</li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <b>Методы исследования.</b> При решении поставленных задач предполагается использование аппарата
                        теории массового обслуживания, методов математического, стохастического, статического и
                        имитационного моделирования с применением высокоуровневых языков программирования.
                    </p>
                    <p>
                        <b>Научна новизна</b> состоит в следующем:
                    </p>

                    <ul>
                        <li>представлены результаты анализа существующей на сегодняшний день Службы Аэронавигационной
                            Информации;
                        </li>
                        <li>предложены методики организации аэронавигационной информации в электронном виде;</li>
                        <li>предложена модель работы сервера обработки аэронавигационных данных;</li>
                        <li>предложена модель процесса производства аэронавигационной информации;</li>
                        <li>предложены методы построения и оптимизации комплексной распределенной системы сбора,
                            храения и распространения аэронавигационных данных на базе глобальных стевых технологий;
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <b>Практической ценностью (значимостью)</b> работы является использование научных результатов,
                        полученных в ходе диссертационных исследований, при модернизации Единой Системы Организации
                        Воздушного Движения (ЕС ОрВД) в части создания и внедрение комплексов аэронавигационной
                        информации в аэропортах, региональных и федеральных центрах. Ценностью также
                        является возможность использования методологий, используемых в данной диссертационной работе,
                        в аналогичных или смежных научных исследованиях.
                    </p>
                    <p>
                        <b>Достоверность</b> полученных в диссертации результатов и выводов подтверждается их
                        реализацией при создании макета комплексной системы сбора, хранения, обработки и распространения
                        аэронавигационных данных, а также экспериментальными результатами.
                    </p>
                    <p>
                        <b>Реализация и внедрение результатов исследований</b>
                        Результаты исследований, отраженные в диссертационной работе, предполагается использовать на
                        ряду с “Федеральной целевой программой "Модернизация Единой системы организации воздушного
                        движения Российской Федерации (2009-2020 годы)” (Утверждена Постановлением Правительства
                        Российской Федерации № 652 от 1 сентября 2008 г.)
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <b>Апробации работы.</b> Основные результаты диссертационной работы докладываются на данном
                        этапе на заседании кафедры и научных конференция на пяти  научно-технических конференциях.
                    </p>
                    <p>
                        <b>Публикации.</b> По материалам диссертации на данный момент опубликовано три стати и тезисы
                        пяти докладов.
                    </p>
                    <p>
                        <b>Структура и объем диссертации:</b>
                        Диссертация состоит из введения, 4 глав, заключения и приложения. Объем составляет ~100 страниц,
                        в том числе основное содержание, X рисунков, Y таблиц, список литературы Z наименований на α
                        страницах. В состав диссертационной работы входят β приложений на γ страницах.
                    </p>
                </div>
            </slide>
        </carousel>
    </div>
</template>

<script>
  import { Carousel, Slide } from 'vue-carousel'

  export default {
    name: 'Abstract',
    components: {
      Carousel,
      Slide
    }
  }
</script>

<style lang="scss" scoped>

</style>
