<template>
    <div>
        <div class="container">
            <h1>Автореферат</h1>
            <p>
                <b>Актуальность работы.</b> Аэронавигационная информация является важнейшим элементом аэронавигационного
                обеспечения полетов. Она используется при создании аэронавигационного оборудования воздушных судов, при
                эксплуатации этого оборудования, как основы аэронавигации, для решения задач использования воздушного
                пространства и УВД, создания сборников аэронавигационной информации и карт, а также выполнения ряда
                других задач.
            </p>
            <p>
                Переход на современные информационные безбумажные технологии обеспечения аэронавигационной информацией
                различных пользователей АНИ, в том числе и полетов воздушных судов, оснащенных комплексом
                пилотажно-навигационного цифрового оборудования, вызывает необходимость создания перспективных
                требований к аэронавигационным данным.
            </p>
            <p>
                Создание системы сбора, хранения и распространения аэронавигационных данных позволит более эффективно
                использовать их в существующих технологиях обеспечения АНИ различных пользователей, а также будет
                способствовать автоматизации этого процесса, позволяя осуществить взаимодействие на информационном и
                техническом уровнях с другими системами обеспечения полетов ВС ГА, которые широко эксплуатируются в
                настоящее время в отрасли или находятся в стадии разработки, а также с зарубежными банками данных АНИ.
            </p>
            <p>
                В связи с этим, <b>предметом исследования</b> является обеспечение требуемого качества аэронавигационных
                данных за счет перехода с бумажных технологий на электронные.
            </p>
            <p>
                <b>Объектом исследования</b> в диссертационной работе является процесс циркуляции аэронавигационных
                данных в целом, а также существующая сегодня в России Служба аэронавигационной информации – САИ РФ, в
                частнотси.
            </p>
            <p>
                <b>Целью</b> диссертационной работы является разработка комплексной технологии создания распределенной
                системы сбора, хранения, распространения аэронавигационных данных на базе глобальных сетевых технологий.
            </p>
            <p>
                Для достижения поставленной цели в ходе исследования необходимо решить следующие основные задачи:
            </p>
            <ul>
                <li>провести анализ современного состояния и перспектив развития аэронавигационного обеспечения в общем
                    и служб аэронавигационной информации (САИ) в частности;
                </li>
                <li>исследовать форматы и технологии сбора, обработки, хранения и распространения аэронавигационной
                    информации в процессе её циркуляции на различных этапах;
                </li>
                <li>исследовать технологии и методы организации циркуляции аэронавигационных данных в электроном виде;
                </li>
                <li>исследовать работу узлов обработки аэронавигационных данных, как основных элементов, влияющих на
                    показатели качества обслуживания при передаче аэронавигационных информации;
                </li>
                <li>разработка комплексной системы сбора, хранения и предоставления аэронавигационных данных на основе
                    предложенных технологических решений.
                </li>
            </ul>
            <p>
                <b>Методы исследования.</b> При решении поставленных задач предполагается использование аппарата теории
                массового обслуживания,
                теории телекоммуникаций, теории моделирования систем, теории вычислительных сетей.
            </p>
            <p>
                Научна новизна заключается в результатах, представляемых в диссертационной работе и выносимых на защиту:
            </p>

            <ul>
                <li>результаты анализа существующей на сегодняшний день Службы аэронавигационной информации;</li>
                <li>методики организации организации аэронавигационной информации в электронном виде;</li>
                <li>модель работы сервера обработки аэронавигационных данных;</li>
                <li>концепция построения комплексной распределенной системы сбора, храения и распространения
                    аэронавигационных данных на базе глобальных стевых технологий;
                </li>
                <li>реализация разработанных моделей и методов в виде программно-аппаратного комлекса.</li>
            </ul>

            <p>
                <b>Практическая ценность</b> работы состоит в использовании научных результатов, полученные в
                диссертационной работе, до практического использования при модернизации Единой Системы Организации
                Воздушного Движения (ЕС ОрВД). Успешно разработан макет исследуемой системы сбора, хранени и
                распространения аэронавигационных данных, на основе которого в дальнейшем предполагается внедрение
                системы в аэропортах, региональных и федеральных центрах.
            </p>
            <p>
                <b>Достоверность</b> полученных в диссертации результатов и выводов подтверждается их практической
                реализацией при создании макета комплексной системы сбора, хранения, обработки и распространения
                аэронавигационных данных.
            </p>
            <p>
                <b>Реализация и внедрение результатов исследований</b>
                Результаты исследований, отраженные в диссертационной работе, предполагается использовать на ряду с
                “Федеральной целевой программой "Модернизация Единой системы организации воздушного движения Российской
                Федерации (2009-2015 годы)” (Утверждена Постановлением Правительства Российской Федерации № 652 от 1
                сентября 2008 г.)
            </p>
            <p>
                <b>Апробации работы.</b> Основные результаты диссертационной работы докладывались и обсуждались…
            </p>
            <p>
                <b>Публикации.</b> По материалам диссертации на данный момент опубликовано три стати и тезисы пяти
                докладов на научно-технических конференциях.
            </p>
            <p>
                <b>Структура и объем диссертации:</b>
                Диссертация состоит из введения, 4 глав, заключения и приложения. Объем составляет 150 страниц, в
                том числе основное содержание, 20 рисунков, 20 таблиц, список литературы 30 наименований на 3 страницах.
                В состав диссертационной работы входят 5 приложений на 20 страницах.
            </p>
        </div>
    </div>
</template>

<script>
  export default {
    name: 'Abstract'
  }
</script>

<style scoped>

</style>
