<template>
    <div>
        <div class="container">
            <h1>ГЛАВА 1. СОСТОЯНИЕ СУЩЕСТВУЮЩЕЙ СИСТЕМЫ ОБЕСПЕЧЕНИЯ ПОЛЬЗОВАТЕЛЕЙ ВОЗДУШНОГО ПРОСТРАНСТВА
                АЭРОНАВИГАЦИОННОЙ ИНФОРМАЦИЕЙ</h1>
            <h2>1.1. Система обеспечения аэронавигационной информацией. Определения, роли, задачи</h2>
            <p>
                Гражданская авиация стала одним из важных факторов мирового развития. Глобализация межгосударственных и
                межнациональных отношений, укрепление экономических связей, расширение гуманитарных отношений и, в
                частности, развитие туризма – вот далеко не полный список областей человеческой деятельности, где
                гражданская авиация играет важнейшую роль. Развитие гражданской авиации приводит к проблеме управления
                воздушным движением (УВД). Три основных показателя, а именно безопасность, регулярность и экономичность
                полетов, тесно связаны друг с другом и зависят от эффективности УВД.
            </p>
            <p>
                История создания структуры системы УВД в стране началась с 1918 года, когда возникла необходимость
                организации воздушных линий. Первым законом нашего государства, заложившим основу организации воздушных
                сообщений и порядка движения летательных аппаратов в воздушном пространстве над территорией страны, был
                Декрет Совета Народных Комиссаров от 17 января 1921г. 'О воздушных передвижениях'. Он явился первым
                государственным актом, регулирующим передвижение всякого рода воздушных аппаратов над территорией
                Российской Федерации и ее территориальными водами. Им определялись порядок и условия по использованию
                авиации, система руководства, как в воздухе, так и на земле, установлен порядок полетов иностранных
                самолетов над территорией нашего государства.
            </p>
            <p>
                Но отойдем от истории. На сегодняшний день управление воздушным движением обеспечивает единая система
                организации воздушного движения (ЕС ОрВД), которая представляет собой комплекс организационных,
                технологических и технических элементов, функционирующих как единое целое и решающих единую задачу –
                обеспечение безопасности полетов. Одной из составляющих ЕС ОрВД является система обеспечения
                аэронавигационной информацией.
            </p>
            <p>
                Аэронавигационная информация (данные) - сведения об структуре воздушного пространства в бумажном или
                электронном виде. Структура воздушного пространства территории представляет собой информацию об
                аэродромах (аэроузлах), касающиеся характеристик и фактического состояния аэродромов, о порядке
                воздушного движения в районе аэродромов, о воздушных трассах и их оборудовании радио-электротехническими
                средствами, а также другие сведения, необходимые для организации, выполнения и управления полетами.
            </p>
            <p>
                В каждой стране существуют государственные службы аэронавигационной информации (САИ), которые
                предоставляют аэронавигационную информацию как для внутригосударственного использования, так и для
                коммерческих фирм, с целью публикации для глобальномирового использования. Государство принимает все
                необходимые меры для обеспечения того, чтобы аэронавигационная информация (данные), которую оно
                предоставляет на своей территории, а также в районах, в которых данное государство несет ответственность
                за обслуживание воздушного движения за пределами своей территории, была адекватной, требуемого качества
                и своевременной. Сюда относятся меры по своевременному предоставлению требуемой информации (данных)
                службе аэронавигационной информации со стороны каждой государственной службы, связанной с полетами
                воздушных судов.
            </p>
            <p>
                Задача службы аэронавигационной информации заключается в обеспечении потока информации (данных),
                необходимой для обеспечения безопасности, регулярности и эффективности международной аэронавигации. Роль
                и значение аэронавигационной информации (данных) существенно изменились в связи с внедрением зональной
                навигации (RNAV), навигации, основанной на характеристиках (PBN), бортовых автоматизированных
                навигационных систем и систем линий передачи данных. Искаженная или ошибочная аэронавигационная
                информация (данные) может отрицательно повлиять на безопасность аэронавигации. Для обеспечения
                единообразия и согласованности в предоставлении аэронавигационной информации (данных), необходимой для
                оперативного использования автоматизированными навигационными системами, государства, по мере
                возможности, избегают использования стандартов и правил, не соответствующих установленным для
                международного применения. Кроме того, служба аэронавигационной информации получает сведения,
                позволяющие ей обеспечивать предполетное информационное обслуживание и удовлетворять потребности в
                информации во время полета. Служба аэронавигационной информации незамедлительно предоставляет службам
                аэронавигационной информации других государств любую информацию (данные), необходимую им для обеспечения
                безопасности, регулярности и эффективности аэронавигации. Служба аэронавигационной информации
                обеспечивает предоставление аэронавигационной информации (данных), необходимой для обеспечения
                безопасности, регулярности и эффективности аэронавигации, в форме, отвечающей эксплуатационным
                требованиям, предъявляемым:
                персоналом, связанным с производством полетов, включая летные экипажи, при планировании полетов и в
                пилотажных тренажерах;
                органом обслуживания воздушного движения, ответственным за полетно-информационное обслуживание и
                службами, отвечающими за предполетную информацию.
            </p>
            <p>
                Служба аэронавигационной информации получает или составляет, проверяет или компонует, редактирует,
                форматирует и издает/хранит и распространяет аэронавигационную информацию (данные), касающуюся всей
                территории государства, а также районов, в которых данное государство ответственность за обслуживание
                воздушного движения за пределами своей территории.
            <h2>1.2 Анализ тенденций развития системы обеспечения аэронавигационной информацией</h2>
            <p>
                В соответствии с глобальным аэронавигационным планом ИКАО был разработан как стратегический документ,
                призванный регулировать внедрение систем CNS/ATM с учетом Глобальной эксплуатационной концепции
                организации воздушного движения и Стратегических целей ИКАО, аэронавигационный совет (коллегия)
                Федеральной аэронавигационной службы отметила, что одной из основных задач при создании и развитии
                Аэронавигационной системы Российской Федерации является осуществление условий для перехода от службы
                аэронавигационной информации к управлению аэронавигационной информацией (далее от САИ к УАИ). Это
                гарантирующее всем пользователям воздушного пространства достижение единообразной и эффективной
                структуры управления аэронавигационной информацией при переходе на цифровые сетевые системы, получение
                необходимых данных для выполнения полета с возможностью визуализации и обеспечение высокого уровня
                безопасности воздушного движения.
            </p>
            <p>
                Глобальный аэронавигационный план содержит рассчитанные на ближайшую и среднесрочную перспективу
                руководящие указания по усовершенствованию аэронавигационной системы, необходимому для обеспечения
                единообразного перехода к системе организации воздушного движения, предусмотренной в Глобальной
                эксплуатационной концепции ОрВД [X]. В частности, в таблице 1-1 главы 1 документа[X] изложены 23
                инициативы глобального плана (GPI). Две из них непосредственно связаны с аэронавигационной информацией
                (GPI-18 – Аэронавигационная информация и GPI-20 – WGS-84), а многие другие косвенно влияют на методы
                обмена аэронавигационной информацией в будущем.
            </p>
            <p>
                Настоящий поэтапный план был разработан для конкретизации и детализации указаний по будущему развитию
                системы аэронавигационной информации. Предусматриваемые изменения таковы, что это развитие именуется как
                переход от служб аэронавигационной информации (САИ) к управлению аэронавигационной информацией (УАИ).
                Данный план содержит практические руководящие указания и рекомендации, предназначенные для использования
                группами регионального планирования и государствами при разработке стратегий внедрения и финансирования,
                необходимых для реализации инициатив глобального плана, связанных с аэронавигационной информацией. В ней
                определены основные этапы, рекомендуемые для обеспечения единообразного эволюционного процесса во всех
                регионах мира, конкретные меры, которые необходимо будет осуществить, и сроки выполнения программ.
            </p>
            <p>
                Предполагается, что указанный план будет служить стратегической направляющей инициативой для обеспечения
                непрерывного усовершенствования системы аэронавигационной информации с точки зрения качества,
                своевременности и выявления новых видов услуг и информационных продуктов в целях повышения уровня
                обслуживания авиационных пользователей. "Дорожная карта" создает основу для разработки стратегий и иных
                инициатив, призванных способствовать реализации целей УАИ в глобальном масштабе. Она должна обеспечить
                для будущей системы УАИ возможность более полного удовлетворения потребностей пользователей воздушного
                пространства и ОрВД в сфере управления информацией.
            </p>
            <p>
                Ожидается, что переход к УАИ не повлечет многочисленных изменений в отношении рамок подлежащей
                распространению аэронавигационной информации. Главное изменение будет состоять во внедрении новых
                информационных продуктов и услуг и усилении акцента на распределении улучшенных данных с точки зрения их
                качества и своевременности в целях удовлетворения потребностей пользователей и содействия повышению
                уровня безопасности полетов, эффективности и экономичности аэронавигационной системы.
            </p>
            <p>
                В рамках глобальной системы организации воздушного движения (ОрВД), служба аэронавигационной информации
                (САИ) станет одной из наиболее ценных и важных служб, способствующих ее реализации. Поскольку глобальная
                система ОрВД, предусмотренная эксплуатационной концепцией, основана на принципах совместного принятия
                решений, то возникнет необходимость в своевременном наличии в электронном виде высококачественной и
                надежной аэронавигационной и метеорологической информации, информации о воздушном пространстве и
                организации воздушных потоков. Некоторые рекомендации ИКАО касались, в частности, вопроса о важном
                значении аэронавигационной информации. В условиях эволюционирования системы ОрВД важную роль играет САИ.
                Основанные на использовании ЭВМ навигационные системы, зональная навигация (RNAV), требуемые
                навигационные характеристики (RNP) и требования к ОрВД вызывают необходимость разработки новых
                соответствующих требований к САИ в отношении качества и своевременности информации. Поэтому роль САИ
                необходимо будет трансформировать в службу управления информацией, изменив при этом круг ее
                обязанностей, сферы ответственности и рамки, чтобы обеспечить соответствие этим новым требованиям и
                решить вопрос с предоставлением информации в этих условиях. Рекомендации Аэронавигационной конференции,
                касающиеся аэронавигационной информации, и вопросы разработки будущей общей (высокого уровня) концепции
                с точки зрения структуры, характера и содержания стратегии эволюции от САИ, предоставляющей традиционный
                информационный продукт, к более широкой системе управления аэронавигационной информацией (УАИ),
                ориентированной на данные.
            </p>
            <p>
                В настоящее время высококачественная аэронавигационная информация зачастую упоминается в
                исследовательских программах как необходимое условие для разработки многих новых функционально
                совместимых средств, которые будут устанавливаться на борту воздушных судов для повышения уровня
                безопасности и эффективности навигации. Эти новые инструменты будут также использоваться в системах ОрВД
                для повышения эффективности, сохраняя при этом уровень безопасности полетов. Это позволит предоставлять
                больше услуг большему количеству воздушных судов в том же воздушном пространстве в те же самые сроки.
            </p>
            <p>
                Мы живем в век Интернета, спутниковой навигации и компьютерных сетей, и вместе с тем наш подход к
                распространению аэронавигационной информации все еще ориентируется на отпечатанные на бумаге карты,
                документы в печатном виде и основанные на телексе тексты сообщений. Системы существуют изолированно.
                Большая часть данных вводится более одного раза в различные компьютеры с использованием клавиатуры, а не
                путем переброски файлов или транзакций из базы данных.
            </p>
            <p>
                Улучшенная аэронавигационная информация, необходима для того, чтобы создать интегрированную и
                функционально совместимую систему ОрВД, которая позволяет поставщикам аэронавигационного обслуживания
                обеспечивать обслуживание большого объема воздушного движения в рамках того же воздушного пространства и
                в течение того же периода времени. Такая система эффективно связала бы воедино весь диапазон услуг от
                структуры воздушного пространства до планирования полетов, планирования полетов в аэропортах и
                обеспечения интервала полетов при сохранении безопасности полетов и авиационной безопасности пассажиров
                и уменьшении экологических последствий для планеты и ее населения.
            </p>
            <p>
                Улучшенная аэронавигационная информация необходима для создания гибкой системы ОрВД, которая снизила бы
                расходы и экологические последствия при одновременном улучшении доступа к загруженному воздушному
                пространству и удаленным аэропортам в развивающихся странах. Такая система позволила бы планировщикам и
                лицам, принимающим решения, принимать надлежащие решения при разработке новых средств и методов,
                основанных на точной информации, которую можно было бы получить своевременно и в нужном месте.
            </p>
            <p>
                Улучшенная аэронавигационная информация необходима для создания системы, которая предоставляет
                пользователям воздушного пространства более широкие права путем повышения их роли в формировании системы
                ОрВД, оказания им помощи в понимании возможных вариантов и принятии решений, основанных на знании
                соответствующей информации, обеспечивая при этом безопасность населения и минимизируя воздействие на
                окружающую среду. В центре такой системы будут потребности пользователей.
            </p>
            <p>
                Искаженная или ошибочная аэронавигационная информация может оказывать негативное воздействие на
                безопасность спутниковой навигации так же, как и неисправные или неверно работающие навигационные
                средства отрицательно влияют на безопасность навигации, основанной на использовании наземных средств.
            </p>
            <p>
                Указанные усовершенствования играют ключевую роль в Глобальной эксплуатационной концепции организации
                воздушного движения, что расставляет новые акценты на все аспекты, связанные с надлежащим управлением
                информацией, в отличие от традиционного подхода, ориентированного на предоставление стандартных
                информационных продуктов исключительно пилоту.
            </p>
            <h2>1.3 Анализ современных проблемных вопросов состояния обеспечения аэронавигационной информации и
                способы</h2>
            <p>
                Текущая ситуация с публикуемой аэронавигационной информацией (АНИ) в России не отвечает требованиям
                безопасности полетов. Из года в год на всевозможных конференциях, семинарах, совещаниях, заседаниях и
                пр. представители авиакомпаний говорят о крайне низком уровне аэронавигационного обеспечения полетов в
                России. Несмотря на то, что в Санкт-Петербургском университете гражданской авиации осуществляется
                подготовка высококвалифицированных специалистов в этой области, они так и остаются невостребованными.
            </p>
            <p>
                Одной из основных задач при формировании Аэронавигационной системы Российской Федерации является
                создание эксплуатационных условий, гарантирующих всем пользователям воздушного пространства право
                доступа к ресурсам аэронавигационной системы, необходимым для удовлетворения их эксплуатационных
                потребностей и обеспечения высокого уровня безопасности воздушного движения.
            </p>
            <p>
                В настоящее время сложилась ситуация, при которой:
            </p>
            <ul>
                <li>положения нормативных документов гражданской авиации Российской Федерации, регулирующие деятельность
                    в области аэронавигационной информации, устарели, не соответствуют стандартам ИКАО и международной
                    практике, мешают гармонизации и интеграции Аэронавигационной системы России с общемировой системой;
                </li>
                существующие службы аэронавигационной информации разобщены по ведомственному принципу, что затрудняет
                <li>оперативный доступ пользователей к требуемой аэронавигационной информации;</li>
                <li>ограниченный объем информационного содержания АИП России не удовлетворяет потребностей пользователей
                    АНИ;</li>
                <li>практически отсутствует контроль качества предоставляемой АНИ;</li>
                <li>не создан механизм финансирования сбора, распространения государственной АНИ;</li>
                не организована сертификация в области сбора, обработки, хранения и распространения АНИ, а также
                <li>проведение экспертной оценки безопасности изменений, вносимых в структуру воздушного пространства;
                </li>
                <li>не обеспечен переход к технологии сбора, обработки, хранения и распространения АНИ в электронном
                    виде;
                </li>
                <li>отсутствует единый электронный федеральный банк аэронавигационных данных по территории России,
                    применение которого могло бы удовлетворить потребности пользователей воздушного пространства.
                </li>
            </ul>
            <p>
                С целью устранения перечисленных проблем, Росаэронавигацией (Росавиация на текщее время) подготовлены
                изменения в Воздушный кодекс Российской Федерации, которые 20 августа 2007 г. одобрены на заседании
                Комиссии Правительства Российской Федерации по законопроектной деятельности.
            </p>
            <p>
                Создание распределенной системы сбора, хранения и распространения аэронавигационных данных на базе
                глобальных сетевых технологий решает выдвинутые задачи и результат совпадает с изменениями
                подготовленными Росаэронавигацией (Росавиацией) 20 августа 2007 г. одобрены на заседании Комиссии
                Правительства Российской Федерации по законопроектной деятельности.
            </p>
            <p>Предлагаемые изменения предусматривают дополнение законодательства, которые позволят в дальнейшем:
            </p>
            <ul>
                <li>формулировка единой структуру многоуровневой подсистемы обеспечения аэронавигационной информации в
                    Российской Федерации, предусматривающей создание государственных организаций, осуществляющих
                    деятельность по сбору, обработке, хранению и распространению государственной АНИ на федеральном и
                    региональном уровнях, и укомплектование их штатной численностью с одновременным решением вопроса
                    подготовки и повышения квалификации персонала;
                </li>
                <li>разработка программного обеспечения (с последующей сертификацией) для автоматизированного сбора,
                    обработки, хранения и распространения государственной АНИ, позволяющего потребителям работать в
                    едином формате и осуществлять обмен АНИ в электронном виде;
                </li>
                <li>внедрить систему качества (менеджмента) в систему обработки аэронавигационной информации,
                    совершенствовать процедуры и процессы управления качеством на каждой функциональной стадии обработки
                    аэронавигационных данных от аэропорта через предприятия, осуществляющие деятельность в области
                    аэронавигационной информации, до потребителя;
                </li>
                <li>создать корпоративную электронную сеть для функционирования автоматизированной системы сбора,
                    обработки, хранения и распространения АНИ;
                </li>
                <li>создать федеральную электронную базу данных АНИ, предусмотрев ее защиту от несанкционированного
                    доступа;
                </li>
                <li>осуществлять контроль за качеством вносимых в структуру воздушного пространства изменений, до их
                    опубликования в государственных документах АНИ;
                </li>
                <li>совершенствовать порядок обеспечения АНИ пользователей воздушного пространства с учетом Стандартов и
                    Рекомендуемой практики ИКАО;
                </li>
                <li>разработать концепцию развития системы обеспечения АНИ в свете внедрения программы CNS/ATM в
                    отечественную практику;
                </li>
                <li>разработать порядок обеспечения государственной АНИ пользователей воздушного пространства,
                    осуществляющих свою деятельность при уведомительном порядке использования воздушного пространства;
                </li>
                <li>создать механизм финансирования сбора, обработки, хранения и распространения государственной АНИ,
                    ведения федеральной электронной базы данных АНИ;
                </li>
                <li>публиковать государственную АНИ в Сборнике аэронавигационной информации (АИП России) в формате,
                    соответствующем Стандартам и Рекомендуемой практике ИКАО. При этом государственная АНИ на
                    региональном уровне должна публиковаться в соответствующих документах АНИ;
                </li>
                <li>разработать единые требования к профессиональной подготовке и переподготовки персонала органов АНИ,
                    в том числе и по ускоренным программам.
                </li>
            </ul>
            <h2>Основные результаты и выводы</h2>

            <p>Результаты по главы 1:</p>
            <ul>
                <li>Проведён анализ современного состояния и перспектив развития системы обеспечения аэронавигационной
                    информации ЕС ОрВД.
                </li>
                <li>Проанализирован Глобальный аэронавигационный план в частности аэронавигационного обеспечения.</li>
                <li>Определены стратегические направляющие для обеспечения непрерывного усовершенствования системы
                    обеспечения аэронавигационной информации с точки зрения качества, своевременности и выявления новых
                    видов услуг и информационных продуктов в целях повышения уровня обслуживания авиационных
                    пользователей.
                </li>
                <li>Сформулирована цель и определены основные задачи исследования.</li>
            </ul>

            <p>
                <b>Полученные результаты позволяют сделать следующие выводы:</b>
                В ходе анализа перспектив развития системы обеспечения аэронавигационной информации РФ установлено, что
                в качестве основополагающего направления развития системы выбрано направление создания распределенной
                системы сбора, хранения и распространения аэронавигационных данных на базе глобальных сетевых
                технологий. Такой подход соответствует всем предъявленным рекомендациям и требованиям как
                аэронавигационного совета (Коллегии) Федеральной аэронавигационной службы РФ, так и концепции
                глобального аэронавигационного плана ИКАО.
            </p>
        </div>
    </div>
</template>

<script>
  export default {
    name: 'Chapter1',
    data () {
      return {
        options: {}
      }
    }
  }
</script>

<style scoped>

</style>
