<template>
    <div>
        <carousel :per-page="1" paginationActiveColor="#42b983" paginationColor="#b2ebd1" :paginationSize="12">
            <slide class="slide">
                <div class="container">
                    <h1>Глава 2. Анализ производственного процесса аэронавигационных данных</h1>
                    <h2>
                        2.1.1 Существующая система предоставления аэронавигационной информации
                    </h2>
                    <p>
                        Главной задачей создания распределенной системы сбора, хранения и распространения
                        аэронавигационных данных
                        на базе глобальных сетевых технологий (далее КАС АНИ – Комплексная Автоматизированная Система
                        Аэронавигационной Информации) в целом является автоматизация органов аэронавигационной
                        информации, созданных
                        в рамках Службы аэронавигационной информации (САИ), которые несут ответственность за организацию
                        предоставления аэронавигационной информации пользователям воздушного пространства Российской
                        Федерации,
                        необходимой для обеспечения безопасности, регулярности и эффективности полетов воздушных судов
                        [ссылка на
                        док].
                    </p>
                    <p>
                        Основная задача органов САИ – получение, составление, проверка, компоновка, редактирование,
                        форматирование,
                        издание, хранение и распространение аэронавигационной информации, касающейся всей территории
                        государства, а
                        также районов ответственности государства за обслуживание воздушного движения за пределами своей
                        территории.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <img width="750px" src="@/assets/chapter2/image2.png">
                    <div>Рис. 2.1 Структурная схема Службы аэронавигационной информации РФ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Информация, подготовленная в виде проектов поправок к документам АНИ или проектов НОТАМ
                        постоянного
                        характера по изменениям на аэродроме или в районе аэродрома, согласованная в установленном
                        порядке,
                        представляется для утверждения начальникам территориальных органов Росавиации, а затем – во ФГУП
                        «ЦАИ» для
                        издания и рассылки.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <img width="650px" src="@/assets/chapter2/image4.png">
                    <div>Рис. 2.2. Схема потоков аэронавигационной информации при создании поправок в АИП, дополнений к
                        АИП,
                        циркуляров.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <img width="650px" src="@/assets/chapter2/image4.png">
                    <div>Рис. 2.3. Схема потоков аэронавигационной информации при создании НОТАМ по плановым изменениям
                        аэронавигационной информации в районе аэродрома гражданской авиации и структуре воздушного
                        пространства.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <img src="@/assets/chapter2/image6.png">
                    <div>Рис. 2.4. Схема потоков аэронавигационной информации при создании НОТАМ, которые требуется
                        издать
                        незамедлительно.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        САИ РФ обеспечивает объединенный пакет аэронавигационной информации, который состоит из:
                    </p>
                    <ul>
                        <li>Сборника аэронавигационной информации (АИП) документа в формате ИКАО, который представляет
                            собой
                            основной
                            источник постоянной информации и информации о временных изменениях, носящих долгосрочный
                            характер;
                        </li>
                        <li>Поправок к АИП (AMDT), которые издаются для публикации долгосрочных изменений содержания АИП
                            в виде
                            заменяемых страниц;
                        </li>
                        <li>Дополнений к АИП (SUP), с помощью которых публикуется информация о временных, заранее
                            планируемых
                            изменениях большой продолжительности;
                        </li>
                        <li>Циркуляров аэронавигационной информации(AIC), которые используются для рассылки информации,
                            не требующей
                            выпуска НОТАМ или включения её в АИП;
                        </li>
                        <li>Извещений для пилотов (НОТАМ), с помощью которых распространяется информация о временных,
                            внезапно
                            возникающих изменениях, например, отказы оборудования. Сообщения НОТАМ (и такие их
                            производные, как
                            SNOWTAM и ASHTAM) являются электронными сообщениями, передаваемыми авиационной фиксированной
                            службой
                            (AFS), в основном посредством сети авиационной фиксированной электросвязи (АФТН). Формат
                            сообщений НОТАМ
                            позволяет осуществлять автоматическую обработку их содержания и представлять потребителям в
                            качестве
                            части бюллетеня предполетной информации. Для максимального использования преимуществ
                            автоматизации,
                            НОТАМ может также издаваться, чтобы особо выделить в БПИ изменение, предварительная
                            информация о котором
                            публиковалась с помощью AIP AMDT или SUP (так называемый «триггерный НОТАМ»);
                        </li>
                        <li>
                            Бюллетеней предполетной информации – БПИ, являющихся подборками сообщений НОТАМ, подобранных
                            по различным
                            категориям информации.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h2>
                        2.1.2 Перспективная система предоставления аэронавигационных данных на основе формат AIXM
                    </h2>
                    <p>
                        Стандарт обмена аэронавигационной информацией является центральным аспектом модернизации
                        аэронавигационной
                        информационной системы, поскольку он обеспечивает:
                    </p>
                    <ul>
                        <li>общий язык представления аэронавигационной информации для интерпретации компьютером и
                            человеком;
                        </li>
                        <li>сохранение расходов по причине повторного использования программного обеспечения и моделей
                            данных;
                        </li>
                        <li>повышение безопасности посредством улучшения целостности данных и своевременного их
                            поступления;
                        </li>
                        <li>уменьшение стоимости за счет повышения качества проверки и интеграции данных.</li>
                        <li>Общепринятый стандарт для аэронавигационной информации обеспечивает повышение эффективности,
                            безопасности и
                        </li>
                        <li>пропускной способности воздушного пространства. Стандарт может применяться в системах:</li>
                        <li>отображения информации в реальном времени, включая все последние изменения, для наземных и
                            бортовых
                            служб;
                        </li>
                        <li>автоматического внесения данных в диаграммы;</li>
                        <li>типа «Электронный пакет полетной информации»;</li>
                        <li>предоставления краткой предполетной информации;</li>
                        <li>планирования полетов и автоматизированного управления воздушным движением.</li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>Службы предоставления аэронавигационной информации переходят от ориентирования на продукт к
                        ориентированию
                        на операции с данными. В настоящей действительности в САИ реализован принцип «система-центр»,
                        где имеется
                        единый центр-источник данных, не сопряженный с внешними системами, которые поддерживаются
                        независимо. Это
                        означает, что при любом изменении аэронавигационной информации, она вручную вносится в каждую
                        систему.
                        В концепцию создания КАС АНИ заложен принцип «данные–центр», определяющий единый источник данных
                        аэронавигационной информации (центральная база данных), предусматривающий автоматическое
                        распространение по
                        всем системам.</p>

                    <p>По этой причине единая модель обмена аэронавигационной информацией имеет ключевое значение в
                        обеспечении
                        сбора, распространения и трансформации аэронавигационной информации по цепочке данных.
                        В 1999 г. Европейская организация по безопасности аэронавигации (Евроконтроль) начала разработку
                        модели
                        обмена аэронавигационной информацией под названием AIXM. Изначально главной целью нового
                        стандарта было его
                        применение в рамках европейской базы данных аэронавигационной информации (EAD). Позднее успех
                        EAD побудил
                        других членов авиационного сообщества рассмотреть модель AIXM в качестве международного
                        стандарта обмена
                        аэронавигационной информацией. В настоящее время разработкой стандарта занимается международная
                        рабочая
                        группа, координаторами которой выступают представители Федеральной Авиационной Администрации США
                        и
                        Евроконтроля. Также участие принимают другие международные организации и представители
                        авиационной
                        промышленности.</p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>С самого начала модель обмена аэронавигационной информацией AIXM включала:</p>
                    <ul>
                        <li>Стандарты и рекомендуемую практику ИКАО;</li>
                        <li>Требования промышленности в виде международных стандартов, таких как ARINC 424, EUROCAE
                            ED-99, RTCA
                            DO-272;
                        </li>
                        <li>Гражданскую и военную составляющие информации по аэронавигации.</li>
                    </ul>
                    <p>
                        При анализе версий 3 и 4 было показано, что модель AIXM покрывает область действия
                        аэронавигационного домена, но стандарт обмена слишком узко сфокусирован на единственном
                        применении: сбор и
                        распространение данных из базы данных. К тому же, в 4-ую версию модели AIXM не были включены
                        новые
                        международные геопространственные стандарты и модели данных, опубликованные после создания
                        модели обмена
                        аэронавигационной информацией. Версия AIXM 5.0, появившаяся в начале 2008 года, была разработана
                        для того,
                        чтобы соответствовать непрерывно расширяющемуся диапазону требований по обмену аэронавигационной
                        информацией,
                        и включила в себя ряд существенных изменений:
                    </p>
                    <ul>

                        <li>Соответствие серии стандартов ISO 19100 для геопространственной информации, включая
                            географический
                            язык разметки (GML);
                        </li>
                        <li>Добавление временной модели, включая поддержку временной и краткосрочной информации,
                            содержащейся в
                            NOTAM;
                        </li>
                        <li>Соответствие последним требованиям промышленности и ИКАО для аэронавигационных данных,
                            включая
                            препятствия, процедуры маневрирования в районе аэродрома и картографические базы данных
                            аэропортов;
                        </li>
                        <li>Модульность и способность к расширению с целью поддержки текущих и перспективных требований
                            к созданию сообщений по аэронавигационной информации.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>Указанные изменения предназначены для решения следующих задач:</p>
                    <ul>
                        <li>Автоматизированного формирования текста, включаемого в Сборник Аэронавигационной Информации
                            (AIP);
                        </li>
                        <li>Автоматизированного создания аэронавигационных схем и диаграмм, а также их публикация;</li>
                        <li>Выпуска интегрированных, географически привязанных NOTAM (xNOTAM);</li>
                        <li>Создания картографических баз данных аэродромов (AMDB);</li>
                        <li>Представления АНИ в рамках электронного пакета полетной информации;</li>
                        <li>Отображения информации на дисплеях Синтетического зрения и вычислительных системах
                            самолетовождения (ВСС - FMS).
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>При создании 5-ой версии стандарта были внесены изменения в версию 4.5 AIXM с целью соответствия
                        самым
                        современным международным требованиям к обмену аэронавигационной информации в следующих
                        областях:</p>

                    <ul>
                        <li>Расширенная модель процедур маневрирования в районе аэродрома, которая соответствует самым
                            современным
                            процедурам по аэронавигационному обслуживанию (Документ 8168 ИКАО) и процедурам
                            маневрирования в районе
                            аэродрома для публикации данных (PANS-OPS и TERPS);
                        </li>
                        <li>Расширенная модель по препятствиям в соответствии с самыми современными требованиями ИКАО и
                            требованиями
                            промышленных компаний.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>Данная версия модели AIXM также рассматривается как основа для разработки стандартизованного
                        взаимодействия
                        «от системы к системе» для всех служб аэронавигационной информации. Рассматриваются не только
                        традиционные
                        действия службы аэронавигационной информации (САИ или AIS), такие как сбор и распространение
                        аэронавигационной информации, но и следующие функции:</p>
                    <ul>
                        <li>Поддержание модернизированных систем бортового оборудования, например «электронный пакет
                            полетной
                            информации»;
                        </li>
                        <li>Извещение пилоту (NOTAM);</li>
                        <li>Производство аэронавигационных диаграмм;</li>
                        <li>Разработка процедур.</li>
                        <li>На момент создания КАС АНИ последняя версия стандарта является AIXM 5.1.</li>
                        <li>Таким образом, формат обмена аэронавигационной информацией AIXM, на данное время охватывает
                            полный
                            спектр
                            информации, циркулирующей в САИ, предполагая, в исключительных случаях, возможность
                            расширения схемы за
                            счёт
                            специализированных возможностей данного формата.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h2>
                        2.2. Разработка вариантов построения КАС
                    </h2>

                    <h3>
                        2.2.1 Концепция создания КАС АНИ
                    </h3>
                    <p>
                        Сложившаяся система обеспечения аэронавигационной информацией имеет существенные недостатки,
                        связанные с
                        текущим уровнем автоматизации органов САИ. К недостаткам системы следует отнести:
                    </p>
                    <ul>
                        <li>отсутствие информационной совместимости как имеющихся в наличии, так и вновь создаваемых АС,
                            по
                            структурам данных, справочникам и классификаторам, другим характеристикам;
                        </li>
                        <li>новые системы создаются на различных программных платформах;
                        </li>
                        <li>автоматизированные технологии организации взаимодействия систем между собой и с
                            информационными
                            системами других государственных ведомств находятся в стадии становления;
                        </li>
                        <li>отсутствует возможность надежного получения полной, достоверной и непротиворечивой
                            информации;
                        </li>
                        <li>отсутствовал единый подход к технической политике, что ведет к снижению эффективности
                            проводимых
                            мероприятий по автоматизации;
                        </li>
                        <li>существует общая тенденция к усложнению информационной архитектуры (увеличение числа систем
                            для
                            автоматизации новых административных процессов), уменьшению ее управляемости, росту
                            трудозатрат на ее
                            сопровождение;
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <ul>
                        <li>необходимое взаимодействие приложений и систем достигается реализацией сложного алгоритма,
                            во многих
                            случаях требующего участия пользователей для обмена и консолидации данных;
                        </li>
                        <li>существующая в САИ система сбора, обработки и выдачи информации обладает ограниченными
                            возможностями
                            (особенно в части электронного документооборота);
                        </li>
                        <li>увеличение объема информационных потоков приводит к тому, что снижается качество их
                            обработки,
                            увеличиваются сроки, снижается оперативность предоставления необходимой информации;
                        </li>
                        <li>
                            разнородность унаследованных систем территориального уровня, разрабатывавшихся в разное
                            время разными
                            разработчиками, а также отсутствие необходимой проектной документации, затрудняет интеграцию
                            унаследованных систем с другими информационными системами САИ.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Эти недостатки устраняются с введением автоматизации САИ РФ в виде КАС АНИ.
                    </p>

                    <img width="1000px" src="@/assets/chapter2/image5.png">
                    <p>
                        Исходя из Концепции создания и развития Аэронавигационной системы России и структуры органов
                        аэронавигационной информации, аналогично Службе аэронавигационной информации, КАС АНИ будет
                        иметь
                        трехуровневую структуру, обеспечивающую решение задач органов САИ на федеральном, региональном и
                        местном
                        (аэродромном) уровнях. Технологическая реализация КАС АНИ будет состоять из элементов.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Порядок межуровневого взаимодействия исключает потерю данных, противоречивость данных,
                        конфликтные ситуации.
                        На каждом уровне готовятся изменения аэронавигационной информации, соответствующие этому уровню.
                        Информация
                        передается в установленном порядке на более высокий уровень для утверждения и на более низкий
                        для
                        использования. В качестве источника достоверной информации выступает Государственная База Данных
                        АэроНавигационной Информации (ГБД АНИ), расположенная в ЦАИ.
                    </p>
                    <p>
                        На основе анализа потоков аэронавигационных данных и общей концепции информационного
                        взаимодействия можно
                        сделать вывод: отдельные аппаратные и программные модули могут использоваться одновременно в
                        различных
                        подсистемах, что делает невозможным и однозначное деление оборудования и системного программного
                        обеспечения
                        по функциональному признаку. Поэтому, в основу деления изделия на составные части положен
                        конструктивный
                        принцип: за единицу деления приняты программно-аппаратные комплексы (ПАК), которые в дальнешем
                        будем
                        называть элементами КАС АНИ.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h3>
                        2.2.1 Задачи элементов КАС АНИ
                    </h3>
                    <p>Рассмотрим функциональные задачи каждого уровня более подробно, для выявления типовых элементов и
                        задач, с
                        целью построения модели системы и возможности выбора её оптимальной технологической архитектуры.
                    </p>

                    <h4>
                        2.2.1.1 Уровень аэропорта. Задачи аэродромного программно-аппаратного комплекса службы
                        аэронавигационной
                        информации (АПАК АНИ)
                    </h4>
                    <p>
                        К органам аэронавигационной информации на уровне аэродрома относятся:
                    </p>
                    <ul>
                        <li>орган аэронавигационной информации аэродрома (аэропорта) – ПАК АНИ аэродрома;</li>
                        <li>органа аэронавигационной информации по ОВД аэродрома (аэропорта) – ПАК АНИ по ОВД
                            аэродрома.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <i>Задачи ПАК АНИ аэродрома (аэропорта):</i>
                    </p>
                    <ul>
                        <li>обработка полученных от служб аэродрома аэронавигационных данных – АНИ;</li>
                        <li>подготовка проектов НОТАМ по изменениям в районе аэродрома;</li>
                        <li>создание и ведение Аэронавигационного паспорта аэродрома;</li>
                        <li>подготовка проектов изменений в Инструкцию по производству полетов в районе аэродрома;</li>
                        <li>подготовка проектов поправок к документам АНИ;</li>
                        <li>создание и ведение электронного банка аэронавигационных данных по району аэродрома
                            (совместно с органом
                            АНИ по ОВД);
                        </li>
                        <li>предоставление информации экипажу или уполномоченным представителям эксплуатанта:</li>
                        <li>Бюллетеня предполетной информации по маршруту полета, по основному и запасным аэродромам;
                        </li>
                        <li>НОТАМ, если содержащаяся в них информация не вошла в бюллетень предполетной информации;</li>
                        <li>Организация и эксплуатация интегрированного брифинга для предполетной подготовки (совместно
                            с органом
                            АНИ по ОВД);
                        </li>
                        <li>обеспечение персонального контроля предоставляемой АНИ.</li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        <i>Задачи ПАК АНИ по ОВД аэродрома (аэропорта):</i>
                    </p>
                    <ul>
                        <li>сбор и передача АНИ по ОВД в районе аэродрома;</li>
                        <li>автоматизированная подготовка данных и разработка проектов схем взлета, посадки и
                            маневрирования в
                            районе аэродрома;
                        </li>
                        <li>подготовка проектов НОТАМ об изменениях АНИ по структуре воздушного пространства и ОВД в
                            районе
                            аэродрома;
                        </li>
                        <li>создание и ведение Банка аэронавигационных данных (совместно с органом АНИ аэродрома);</li>
                        <li>автоматизированная подготовка и проведение интегрированного брифинга для предполетной
                            подготовки
                            (совместно с органом АНИ аэродрома);
                        </li>
                        <li>обеспечение персонального контроля предоставляемой АНИ.</li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h4>
                        2.2.1.2 Региональный уровень. Задачи регионального программно-аппаратного комплекса службы
                        аэронавигационной
                        информации (РПАК АНИ)
                    </h4>
                    <p>
                        <a target="_blank"
                           href="https://docs.google.com/document/d/1J8Kbut35T8p2_pO58ZJk0Ch_UcPWiQsZU7PVnSd-c_E/edit?usp=sharing">
                            см полный текст Главы 2
                        </a>
                    </p>
                    <h4>
                        2.2.1.3 Федеральный уровень. Задачи федерального программно-аппаратного комплекса службы
                        аэронавигационной
                        информации (ФПАК АНИ)
                    </h4>
                    <p>
                        <a target="_blank"
                           href="https://docs.google.com/document/d/1J8Kbut35T8p2_pO58ZJk0Ch_UcPWiQsZU7PVnSd-c_E/edit?usp=sharing">
                            см полный текст Главы 2
                        </a>
                    </p>
                    <h4>
                        2.2.1.4 Центральный банк данных. Задачи государственной базы данных аэронавигационной информации
                        (ГБД АНИ)
                    </h4>
                    <p>
                        <a target="_blank"
                           href="https://docs.google.com/document/d/1J8Kbut35T8p2_pO58ZJk0Ch_UcPWiQsZU7PVnSd-c_E/edit?usp=sharing">
                            см полный текст Главы 2
                        </a>
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h4>
                        2.2.1.5 Общая функциональная структура КАС АНИ
                    </h4>
                    <p>
                        Проанализировав основные задачи элементов КАС АНИ можно сделать вывод: главным назначением КАС
                        АНИ является
                        регистрация и накоплении аэронавигационной информации и предоставлении ее по запросам
                        пользователей. Также,
                        система в минимальной степени ориентирована на сложную обработку хранимых данных и в
                        максимальной стенени
                        прндназначена для обслуживания пользователей, сбор и предоставление актуальной и достоверной
                        аэронавигационной информации.
                    </p>
                    <p>
                        Перечисленные особенности обусловливают определенную специфику КАС АНИ. К наиболее важному
                        принципу
                        организации КАС АНИ можно отнести независимость процесса обработки запросов пользователей и
                        регистрации в
                        системе новой аэронавигационной информации. Система обслуживает запросы, связанные с поиском в
                        базе данных
                        необходимой инфомрации, при этом пополнение базы данных проводится путем добавления
                        (регистрации) новых
                        записей или внесения изменений в имеющиеся.
                    </p>
                    <p>
                        В связи с этим, описанный принцип организации КАС АНИ позволяет выделить два основных уровня
                        организации
                        системы:
                    </p>
                    <ul>
                        <li>
                            уровень регистрации (приема и подготовки) данных, где происходит процесс прием и первичной
                            обработки
                            данных, подготовка и ввод данных в ГБД системы;
                        </li>
                        <li>
                            уровень обслуживания запросов пользователей, где производится процесс приема и обработки
                            запросов
                            пользователей и выдача информации.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Таким образом, каждый уровень формирует определенный набор задач КАС АНИ, которые можно
                        представить в виде
                        следующих классов, строго соответсвующих уровням:
                    </p>
                    <ul>
                        <li>
                            регистрация поступающей информации, включающая прием, проверку и загрузку в базы данных;
                        </li>
                        <li>
                            обслуживание запросов пользователей системы (предоставление требуемой информации по запросам
                            пользователей).
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Схема потоков регистрируемых данных КАС АНИ, наглядно представляющая поток регистрируемых данных
                        системы,
                        представлена на рис. 2.6. Схема иллюстрирует информационный поток процесса регистрации, а также
                        функциональные задачи ПАК’ов в процессе регистрации и состав данных, участвующих в этом
                        процессе.
                    </p>
                    <img width="650px" src="@/assets/chapter2/image1.png">
                    <div>Рис. 2.6. Схема потоков регистрируемых данных КАС АНИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Схема потоков предоставляемых данных КАС АНИ представлена на рис. 2.7. Схема иллюстрирует
                        информационный
                        поток процесса предоставления информации пользователям системы КАС АНИ. Состав предоставляемых
                        данных
                        отличается в зависимости от технической реализации, что будет учтено при моделировании в
                        дальнейшем.
                    </p>
                    <img width="1280px" src="@/assets/chapter2/image7.png">
                    <div>Рис. 2.7. Схема потоков предоставляемых данных КАС АНИ .</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h3>
                        2.2.2 Технологические решения КАС АНИ и варианты реализации
                    </h3>
                    <h4>
                        2.2.2.1 Основные элементы КАС АНИ
                    </h4>
                    <p>
                        В процессе разработки КАС АНИ программно-аппаратные комплексы каждого функционального элемента
                        системы
                        реализованы на типовом комплексе оборудования.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Одним из типовых решений является ПАК, который состоит из шкафа группового оборудования и
                        отдельного
                        рабочего места. Шкафы группового оборудования включают сервера подсистем, а также рабочие места,
                        расположенные в стойке группового оборудования, предназначенные для выполнения специальных
                        функций
                        технического контроля и управления работой группового оборудования. ПАК в этом случае является
                        серверным
                        (сПАК). К стойке группового оборудования по прямому каналу связи, основанному на технологии
                        Ethernet,
                        подключено автоматизированное рабочее место (АРМ), состоящее из персонального компьютера и
                        периферийного
                        оборудования (рисунок 2.7).
                    </p>
                    <img width="800px" src="@/assets/chapter2/image9.png">
                    <div>Рис. 2.7. Состав оборудования типового сПАК КАС АНИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        В процессе модернизации, за счёт применения новых технологий в разработке программных
                        составляющих
                        комплекса, появляется возможность минимизировать затраты на оборудование и существенно снизить
                        сложность
                        внедрения разрабатываемой системы. При этом измениться состав оборудования программно-аппаратных
                        комплексов,
                        вследствие поэтапного перехода на централизованную организацию обмена данными.
                    </p>
                    <p>
                        При реализации централизованной(-ых) баз(-ы) данных, взамен распределенным, в результате
                        перехода на
                        терминальный доступ к данным, типовой состав оборудования упрощается, а ПАК в этом случае
                        является
                        терминальным (тПАК). В результате исключается серверное оборудование ПАК’а, предназначенное для
                        хранения и
                        обработки хранимых данных, т.е. серверные шкафы группового оборудования отсутствуют. В
                        результате т ПАК
                        состоит из персонального компьютера и периферийного оборудования (рисунок 2.8). Связь с
                        групповым
                        оборудованием обработки и хранения данных более высокого уровня осуществляется на основе
                        удалённого
                        взаимодействия, используя межуровневый канал связи.
                    </p>
                    <img width="400px" src="@/assets/chapter2/image8.png">
                    <div>Рис. 2.8. Состав оборудования типового тПАК КАС АНИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Центральный банк данных (государственная база данных аэронавигационной информации – ГБД АНИ) не
                        является
                        типовым функциональным элементом системы и несколько отличается от ПАК’ов функциональных
                        уровней. ГБД АНИ
                        является ядром хранения данных в системе и присутствует в единственном числе. Все потоки данных
                        местных и
                        региональных уровней, а также поток данных федерального уровня циркулируют через центральный
                        банк данных
                        АНИ. В связи с этим, на оборудования ГБД АНИ нагрузка значительно выше, чем на элементы
                        функциональных
                        уровней системы. Оборудование ГБД АНИ, включает шкаф группового оборудования, состоящего из
                        кластерной
                        серверной системы с резервированием и повышенной степенью отказоустойчивости. Также в составе
                        рабочее место,
                        расположенное в стойке оборудования ПАК-ГБД, предназначенные для выполнения специальных функций
                        технического
                        контроля и управления работой кластерного серверного оборудования. Количество серверов
                        кластерной системы
                        ГБД АНИ в различных вариантах реализации КАС АНИ варьируется, в зависимости от нагрузки.
                    </p>
                    <img width="600px" src="@/assets/chapter2/image12.png">
                    <div>Рис. 2.9. Состав оборудования ПАК ГБД АНИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h4>
                        2.2.2.2 Различные варианты реализации КАС АНИ
                    </h4>
                    <p>
                        Одной из целей диссертационного исследования является задача выбора архитектуры системы в целом,
                        на основе
                        анализа вариантов технологических решений. А именно какие из предложенных типовых решений
                        реализации ПАК
                        оптимальны для реализации КАС АНИ.
                    </p>
                    <p>
                        При различных вариантах построения, функциональная структура системы, задачи, состав данных,
                        циркуляция АНИ
                        (см. п. 2.2.1), основанные на структуре САИ (см. п. 2.1.1), остаются неизменными. Различаются
                        лишь
                        технологическая реализация КАС АНИ.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №1 реализации системы является технологическая структура, где каждый ПАК реализует
                        серверное решение (сПАК) и не подразумевают использования терминальных технологий. Структура
                        данного технологического решения представлена на рисунке 2.10.
                    </p>
                    <img width="1200px" src="@/assets/chapter2/image10.png">
                    <div>Рис. 2.10. Вариант №1 реализации КАС АНИ. Реализация сПАК на всех объектах САИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        В процессе НИР и НИОКР был создан макет КАС АНИ, состоящий из одного аэропорта и одного
                        региона.
                    </p>
                    <p>
                        Особенностью такой реализации является принцип распределенного хранения данных. Каждый
                        аэродромный ПАК
                        системы при этом непосредственно хранит все данные, которые относятся к зоне ответственности
                        данного органа
                        САИ. Эти данные дублируются, и хранятся на соответствующем ПАК регионального уровня, за которым
                        закреплены
                        все аэропортовые службы данного региона. Федеральные ПАК’ы также дублируют данные низ лежащих
                        уровней. ГБД
                        АНИ дублирует все аэронавигационные данные ПАК’ов системы. Соответственно, при такой реализации,
                        необходима
                        синхронизация данных каждого ПАК, что требует больших трудозатрат при реализации программного
                        обеспечения
                        (ПО). По причине внедрения на каждом объекте органа САИ отдельно стоящих серверных стоек
                        сложность внедрения
                        и трудозатраты также увеличиваются. На основе этого принято решение по модернизации существующей
                        системы.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        В ходе исследований предстоит:
                    </p>
                    <ul>
                        <li>исследовать вероятностный характер информационных потоков системы;</li>
                        <li>разработать различные варианты построения (модернизация существующей системы)
                            технологической структуры
                            КАС АНИ, определив оптимальные варианты на основе математических моделей.
                        </li>
                        <li>
                            Одним из возможных вариантов совершенствования, с целью обеспечения менее затратного
                            внедрения КАС АНИ,
                            является использование тПАК, описанных выше. Предположительно, реализация тПАК’ов
                            значительно снизит
                            стоимость и простоту внедрения системы, что наглядно видно по наличию оборудования в тПАК’е,
                            в отличие
                            от сПАК.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №2 реализации системы является технологическая структура, реализующая на местном
                        (аэродромном)
                        уровне тПАК’ы. Уровень региона реализован в виде сПАК. Каждый ПАК органа САИ на уровне аэродрома
                        связывается
                        с региональной базой данных на основе терминальной технологии. Региональный и федеральный уровни
                        реализованы
                        идентично варианту №1 построения КАС АНИ. Вариант реализации представлен на рисунке 2.11.
                    </p>
                    <img width="1200px" src="@/assets/chapter2/image11.png">
                    <div>Рис. 2.11. Вариант №2 реализации КАС АНИ. Реализация тПАК на местном уровне.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №3 реализации системы является технологическая структура, реализующая на местном
                        (аэродромном) и
                        региональном уровне тПАК’ы. В результате базы данных реализованы только на федеральном уровне
                        (ПАК “Центр
                        АНИ”, ПАК “Центральный орган САИ”, ПАК “Центральный орган по ОрВД” и, непосредственно, сама ГБД
                        АНИ). Все
                        остальные ПАК основаны на терминальном доступе (тПАК). Вариант реализации представлен на рис.
                        2.12.
                    </p>
                    <img width="1200px" src="@/assets/chapter2/image13.png">
                    <div>Рис. 2.12. Вариант №3 реализации КАС АНИ. Реализация тПАК на местном и региональном уровне.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №4 (рис. 2.13) реализации системы является технологическая структура, реализующая на
                        местном
                        (аэродромном), региональном и федеральном уровне тПАК’ы. В результате в системе реализуется
                        единая
                        централизованная база данных аэронавигационной информации, существующая в единственном числе.
                        Все потоки
                        данных местных и региональных уровней, а также поток данных федерального уровня и сторонних
                        систем
                        циркулируют через центральный банк данных АНИ. В связи с этим, на оборудования ГБД АНИ нагрузка
                        на несколько
                        порядков выше, чем на элементы функциональных уровней системы. Реализация подобной архитектуры
                        требует
                        детальной разработки организации хранения данных с использованием кластерной системы хранения
                        данных,
                        обеспечения повышенной безопасности и пр.
                    </p>
                    <img width="1000px" src="@/assets/chapter2/image14.png">
                    <div>Рис. 2.13. Вариант №4 реализации КАС АНИ. Реализация тПАК на местном, региональном и
                        федеральном уровне.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №5 (рис. 2.14) реализации системы является технологическая структура, реализующая на
                        местном
                        (аэродромном), региональном и федеральном уровне тПАК’ы идентична варианту №3 с единственным
                        исключением:
                        отсутствует региональный уровень в принципе, что соответственно исключает реализацию ПАК’ы
                        регионального
                        уровня. Элементы федерального уровня также реализуются в виде сПАК с локальными базами данных,
                        распределенных с ГБД АНИ. Все функции и задачи регионального уровня выполняются на федеральном
                        уровне.
                        Результатом является объединение служб регионального и федерального уровня, как одного из
                        вариантов будущего
                        развития структуры САИ в целом.
                    </p>
                    <img width="1200px" src="@/assets/chapter2/image15.png">
                    <div>Рис. 2.14. Вариант №5 реализации КАС АНИ. Реализация тПАК на местном, региональном и
                        федеральном уровне.
                    </div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Вариантом №6 (рис. 2.15) реализации системы является технологическая структура, реализующая на
                        местном
                        (аэродромном), региональном и федеральном уровне тПАК’ы идентична варианту №5 с исключением:
                        элементы
                        федерального уровня реализуются в виде тПАК. Единственная база данных – ГБД АНИ. Все функции и
                        задачи
                        регионального уровня выполняются на федеральном уровне.
                    </p>
                    <img width="1200px" src="@/assets/chapter2/image16.png">
                    <div>Рис. 2.15. Вариантом №6 реализации КАС АНИ.</div>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Одной из задач диссертационного исследования является построение имитационных моделей
                        разработанных архитектурных решений КАС АНИ и на основе полученных результатов предложение
                        практических решений по модернизации КАС АНИ.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <br><br><br><br><br><br><br>
                    <a target="_blank"
                       href="https://docs.google.com/document/d/1J8Kbut35T8p2_pO58ZJk0Ch_UcPWiQsZU7PVnSd-c_E/edit?usp=sharing">
                        Полный текст Главы 2
                    </a>
                </div>
            </slide>
        </carousel>
    </div>
</template>
<!--https://docs.google.com/document/d/1J8Kbut35T8p2_pO58ZJk0Ch_UcPWiQsZU7PVnSd-c_E/edit?usp=sharing-->
<script>
  import { Carousel, Slide } from 'vue-carousel'

  export default {
    name: 'Chapter2',
    components: {
      Carousel,
      Slide
    },
    mounted () {

    }
  }
</script>

<style scoped>
    img {
        max-width: 1200px;
    }
</style>
