<template>
    <carousel :per-page="1" paginationActiveColor="#42b983" paginationColor="#b2ebd1" :paginationSize="12">
        <slide class="slide">
            <div class="container">
                <h1>ГЛАВА 3 Моделирование изучаемых явлений КАС АНИ</h1>
                <p>
                    Для оценки качества работы КАС АНИ на начальном этапе необходимо определить методы анализа и
                    моделирования, которые будут использованы для исследования изучаемых явлений. Рассматриваемая
                    система является динамической системой, предназначенной для эффективного обслуживания случайного
                    потока заявок при ограниченных ресурсах системы [Шелухин, Тенякшев, Осин – Моделирование
                    информационных систем].
                </p>
                <p>
                    Таким образои, основываясь на теоретических аспектах и исследованиях телекоммуникационных систем,
                    широко рассмотренных в работах авторов [список литературы теории массового обслуживания], одним из
                    математических методов исследования КАС АНИ, которая является сложной стохастической системой, может
                    быть использован математический аппарат теории массового обслуживания.
                </p>
                <p>
                    Теория предназначена для моделирования сложных систем и исследования протекающих в них процессов на
                    основе подхода представления систем в виде систем массового обслуживания (СМО) [1-10 Алгазинов и
                    Сирота – Анализ и .... стр 344]. Диссертационные исследования основаны на применении данной теории в
                    большинстве протекающих процессов рассматриваемой системы.
                </p>
            </div>
        </slide>
        <slide class="slide">
            <div class="container">
                <h2>3.1 Определение общих понятий разрабатываемой модели</h2>
                <p>
                    В ходе математической формализации систем как СМО они традиционно представляются в
                    виде композиции элементарных приборов обслуживания (Q-схем), соединенных в соответствии с имеющимися
                    взглядами на облик моделируемой системы [1-10 Алгазинов и Сирота – Анализ и .... стр 344]. Основные
                    элементы схемы представлены на рисунке 3.1.
                </p>
                <img width="1000px" src="@/assets/chapter3/image1.png">
                <div>Рисунок 3.1. Обобщенная структурная схема СМО.</div>
            </div>
        </slide>
        <slide class="slide">
            <div class="container">
                <p>
                    Отметим случайных характер поступления заявок и случайных характер промежутков времени, необходимых
                    для выполнения заявок. В целом, имеем случайный процесс, в котором возможны как перегрузки, так и
                    простои.
                </p>
                <p>
                    На основе исследований предыдущей главы видно, что работа КАС АНИ заключается в обслуживании
                    поступающего на неё потока требований или заявок (либо на регистрацию новых данных, либо на
                    предоставление). Заявки поступают в систему одна за другой в некоторые случайные моменты времени.
                    Обслуживание поступившей заявки продолжается какое-то время, после чего система освобождается для
                    обслуживания очередной заявки.
                </p>
                <p>
                    С точки зрения моделирования КАС АНИ как СМО, система предназначена для обслуживания входного потока
                    заявок с заданной эффективностью. Собственно, <b><i>основной целью моделирования и является оценка
                    этой
                    эффективности в зависимости от структуры и параметров всей системы.</i></b> Поэтому необходимо
                    задать
                    показатели эффективности. Для различных типов СМО показатели эффективности имеют существенно
                    различный характер. По этой причине, определим, какие именно показатели качества необходимо
                    использовать в данном исследовании.
                </p>
            </div>
        </slide>
        <slide class="slide">
            <div class="container">
                <h2>3.2 Определение характеристики качества работы системы</h2>
                <p>
                    Показатели (характеристики), которые в количественной форме демонстрируют возможности системы по
                    сбору и регистрации данных, а также по обслуживанию пользователей – являются показателями качества
                    работы системы и её составных элементов. Наличие таких показателей дает возможность с объективной
                    точки зрения сравнить различные варианты построения системы
                </p>
                <p>
                    В случае моделирования СМО с отказами используются следующие показатели эффективности:
                </p>
                <ul>
                    <li>
                        абсолютная пропускная способность Q, определяющая среднее количество заявок, обслуживаемых за
                        время
                        T;
                    </li>
                    <li>
                        относительная пропускная способность q, характеризующая отношение среднего количества
                        обслуженных
                        заявок Q к среднему числу λ поступивших за время T заявок (q = Q / λ);
                    </li>
                    <li>
                        среднее число одновременно занятых каналов обслуживания n3 и коэффициент использования каналов
                        Ku=n3/n.
                    </li>
                </ul>
                <p>
                    В случае моделирования СМО с ожиданием используются следующие показатели эффективности:
                </p>
                <ul>
                    <li>вероятность не превышения времени ожидания заявки в очереди некоторого предельного значения</li>
                    <li>среднее количество заявок в очереди и в системе с целом (в очереди и на обслуживании);</li>
                    <li>среднее время пребывания заявки в очереди и в системе с целом (в очереди и на обслуживании);
                    </li>
                    <li>среднее количество одновременно занятых каналов и коэффициент их использования</li>
                </ul>
                <p>
                    Для СМО смешанного типа используются обе группы показателей, из которых наиболее важным является
                    относительная пропускная способность.
                </p>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <p>
                    Основываясь на результатах исследований, полученных в пункте 2.2.2.1 предыдущей главы, примем за
                    узел обработки функциональный элемент КАС АНИ – ПАК. Таким образом, узлом обработки КАС АНИ
                    являются три типа элемента системы, а именно: серверный ПАК; терминальный ПАК; ГБД АНИ.
                    Каждый из этих элементов является узлом обработки системы.
                </p>
                <p>
                    Таким образом, обозначим его в виде элемента Q-схемы. Каждый такой элемент будет имеет различные
                    параметры и представлен в виде элементарных приборов обслуживания (рисунок). Различия будут
                    присутствовать при реализации определенных технических решений и выборе алгоритмов работы, что
                    предполагается рассмотреть в дальнейших пунктах исследования.
                </p>
                <p>
                    Основываясь на исследованиях потока данных КАС АНИ главы 2 пункта 2.2.1.5, функционал единичного
                    элемент системы может включать в себя:
                </p>
                <ul>
                    <li>генерацию заявок на обработку, соответственно, являясь источником заявок;</li>
                    <li>обслуживание заявок, поступающих с нижележащих элементов системы (регистрация, утверждение,
                        публикация, предоставление и т.д.).
                    </li>
                </ul>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <br><br><br>
                <img width="200px" src="@/assets/chapter3/image2.png"/><br><br><br>
                <div>Рисунок 3.2. Генерация заявок.</div>
                <br><br><br><br><br>
                <img width="600px" src="@/assets/chapter3/image3.png"><br><br><br>
                <div>Рисунок 3.3. Обслуживание заявок</div>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <p>
                    Прежде всего, необходимо ввести исходное описание системы [А. Сирота,
                    Компьютерное моделирование и оценка эффективности сложных систем].
                    Оно определяется составом элементов и собственными внутренними параметрами, в число которых входят:
                </p>
                <ul>
                    <li>количество источников входных потоков заявок и их интенсивности</li>
                    <li>количество фаз обслуживания заявок;</li>
                    <li>количество накопителей в каждой фазе ;</li>
                    <li>емкости (предельные размеры очереди) накопителей ;</li>
                    <li>количество каналов обслуживания в каждой фазе и интенсивности потоков обслуживания каналов</li>
                </ul>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <img width="800px" src="@/assets/chapter3/image4.png"/><br><br><br>
                <div>Рисунок 3.4. Представление процесса регистрации документов КАС АНИ в виде модели СМО.</div>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <img width="1100px" src="@/assets/chapter3/image5.png"/><br><br><br>
                <div>Рисунок 3.5. Структурная схема модели СМО процесса регистрации документов.</div>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <h3>
                    3.4.2 Имитационная модель
                </h3>
                <p>
                    В соответствии с модульным принципом построения в имитационной модели должны присутствовать
                    несколько стандартных элементов, описываемых своими состояниями и определяющих, тем самым, общее
                    множество состояний системы.
                </p>
                <ul>
                    <li>
                        Источники
                    </li>
                    <li>
                        Накопители
                    </li>
                    <li>
                        Каналы обслуживания
                    </li>
                </ul>
                <p>
                    Таким образом, при имитации процесса функционирования СМО на основе использования формализма Q-схем
                    в программе должны быть организованы три типа стандартных модулей, состояния которых (и всей
                    системы в целом) полностью описываются следующими массивами данных:
                </p>
                <div>
                    []arraySource{}, []arrayStore{}, []arrayChannel{}
                </div>
                <p>
                    В моделирующем алгоритме для СМО  в рамках внешнего цикла по числу статических испытаний
                    (реализаций)
                    осуществляется поиск ближайшего по времени изменения состояния элементов системы
                    связанного либо с поступлением новой заявки от источников, либо с высвобождением канала обслуживания
                    одной из фаз. После этого происходит переход к соответствующему модулю имитации активности и далее к
                    модулям, отвечающему за изменения состояний пассивных элементов в соответствии с воздействиями
                    активных элементов.
                </p>
            </div>
        </slide>

        <slide class="slide">
            <div class="container">
                <h2>
                    На данном этапе активно ведётся дальнейшая разработка имитационной моедли...
                </h2>
            </div>
        </slide>
    </carousel>
</template>

<script>
  import { Carousel, Slide } from 'vue-carousel'

  export default {
    name: 'Chapter3',
    components: {
      Carousel,
      Slide
    }
  }
</script>

<style scoped>

</style>
