<template>
    <div>
        <carousel :per-page="1" paginationActiveColor="#42b983" paginationColor="#b2ebd1" :paginationSize="12">
            <slide class="slide">
                <div class="container">
                    <h1>ГЛАВА 1. СОСТОЯНИЕ СУЩЕСТВУЮЩЕЙ СИСТЕМЫ ОБЕСПЕЧЕНИЯ ПОЛЬЗОВАТЕЛЕЙ ВОЗДУШНОГО ПРОСТРАНСТВА
                        АЭРОНАВИГАЦИОННОЙ ИНФОРМАЦИЕЙ</h1>
                    <h2>1.1. Система обеспечения аэронавигационной информацией. Определения, роли, задачи</h2>
                    <p>
                        <b>Аэронавигационная информация (данные)</b> - сведения об структуре воздушного пространства в
                        бумажном или электронном виде. Структура воздушного пространства территории представляет собой
                        информацию об аэродромах (аэроузлах), касающиеся характеристик и фактического состояния
                        аэродромов, о порядке воздушного движения в районе аэродромов, о воздушных трассах и их
                        оборудовании радио-электротехническими средствами, а также другие сведения, необходимые для
                        организации, выполнения и управления полетами.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        В каждой стране существуют государственные службы аэронавигационной информации (САИ), которые
                        предоставляют аэронавигационную информацию как для внутригосударственного использования, так и
                        для коммерческих фирм, с целью публикации для глобальномирового использования. Государство
                        принимает все необходимые меры для обеспечения того, чтобы аэронавигационная информация
                        (данные), которую оно предоставляет на своей территории, а также в районах, в которых данное
                        государство несет ответственность за обслуживание воздушного движения за пределами своей
                        территории, была адекватной, требуемого качества и своевременной. Сюда относятся меры по
                        своевременному предоставлению требуемой информации (данных) службе аэронавигационной информации
                        со стороны каждой государственной службы, связанной с полетами воздушных судов.
                    </p>
                    <p>
                        Задача службы аэронавигационной информации заключается в обеспечении потока информации (данных),
                        необходимой для обеспечения безопасности, регулярности и эффективности международной
                        аэронавигации.
                    </p>
                    <p>
                        Служба аэронавигационной информации получает или составляет, проверяет или компонует,
                        редактирует, форматирует и издает/хранит и распространяет аэронавигационную информацию (данные),
                        касающуюся всей территории государства, а также районов, в которых данное государство
                        ответственность за обслуживание воздушного движения за пределами своей территории.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h2>1.2 Анализ тенденций развития системы обеспечения аэронавигационной информацией</h2>
                    <p>
                        В соответствии с глобальным аэронавигационным планом ИКАО был разработан как стратегический
                        документ,
                        призванный регулировать внедрение систем CNS/ATM (Communication, Navigation, Surveillance /
                        Air Traffic Management) с учетом Глобальной эксплуатационной концепции
                        организации воздушного движения и Стратегических целей ИКАО, аэронавигационный совет (коллегия)
                        Федеральной аэронавигационной службы отметила, что одной из основных задач при создании и
                        развитии Аэронавигационной системы Российской Федерации является осуществление условий для
                        перехода от службы
                        аэронавигационной информации к управлению аэронавигационной информацией (далее от САИ к УАИ).
                    </p>
                    <p>
                        Глобальный аэронавигационный план содержит рассчитанные на ближайшую и среднесрочную перспективу
                        руководящие указания по усовершенствованию аэронавигационной системы,
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        Мы живем в век Интернета, спутниковой навигации и компьютерных сетей, и вместе с тем наш подход
                        к
                        распространению аэронавигационной информации все еще ориентируется на отпечатанные на бумаге
                        карты,
                        документы в печатном виде и основанные на телексе тексты сообщений. Системы существуют
                        изолированно.
                        Большая часть данных вводится более одного раза в различные компьютеры с использованием
                        клавиатуры, а не
                        путем переброски файлов или транзакций из базы данных.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h2>1.3 Анализ современных проблемных вопросов состояния обеспечения аэронавигационной информации и
                        способы</h2>
                    <p>
                        Текущая ситуация с публикуемой аэронавигационной информацией (АНИ) в России не отвечает
                        требованиям
                        безопасности полетов. Из года в год на всевозможных конференциях, семинарах, совещаниях,
                        заседаниях и
                        пр. представители авиакомпаний говорят о крайне низком уровне аэронавигационного обеспечения
                        полетов в
                        России. Несмотря на то, что в Санкт-Петербургском университете гражданской авиации
                        осуществляется
                        подготовка высококвалифицированных специалистов в этой области, они так и остаются
                        невостребованными.
                    </p>
                    <p>
                        Одной из основных задач при формировании Аэронавигационной системы Российской Федерации является
                        создание эксплуатационных условий, гарантирующих всем пользователям воздушного пространства
                        право
                        доступа к ресурсам аэронавигационной системы, необходимым для удовлетворения их эксплуатационных
                        потребностей и обеспечения высокого уровня безопасности воздушного движения.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        В настоящее время сложилась ситуация, при которой:
                    </p>
                    <ul>
                        <li>положения нормативных документов гражданской авиации Российской Федерации, регулирующие
                            деятельность
                            в области аэронавигационной информации, устарели, не соответствуют стандартам ИКАО и
                            международной
                            практике, мешают гармонизации и интеграции Аэронавигационной системы России с общемировой
                            системой;
                        </li>
                        существующие службы аэронавигационной информации разобщены по ведомственному принципу, что
                        затрудняет
                        <li>оперативный доступ пользователей к требуемой аэронавигационной информации;</li>
                        <li>ограниченный объем информационного содержания АИП России не удовлетворяет потребностей
                            пользователей
                            АНИ;
                        </li>
                        <li>практически отсутствует контроль качества предоставляемой АНИ;</li>
                        <li>не создан механизм финансирования сбора, распространения государственной АНИ;</li>
                        не организована сертификация в области сбора, обработки, хранения и распространения АНИ, а также
                        <li>проведение экспертной оценки безопасности изменений, вносимых в структуру воздушного
                            пространства;
                        </li>
                        <li>не обеспечен переход к технологии сбора, обработки, хранения и распространения АНИ в
                            электронном
                            виде;
                        </li>
                        <li>отсутствует единый электронный федеральный банк аэронавигационных данных по территории
                            России,
                            применение которого могло бы удовлетворить потребности пользователей воздушного
                            пространства.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>Предлагаемые изменения предусматривают дополнение законодательства, которые позволят в
                        дальнейшем:
                    </p>
                    <ul>
                        <li>формулировка единой структуру многоуровневой подсистемы обеспечения аэронавигационной
                            информации в
                            Российской Федерации, предусматривающей создание государственных организаций, осуществляющих
                            деятельность по сбору, обработке, хранению и распространению государственной АНИ на
                            федеральном и
                            региональном уровнях, и укомплектование их штатной численностью с одновременным решением
                            вопроса
                            подготовки и повышения квалификации персонала;
                        </li>
                        <li>разработка программного обеспечения (с последующей сертификацией) для автоматизированного
                            сбора,
                            обработки, хранения и распространения государственной АНИ, позволяющего потребителям
                            работать в
                            едином формате и осуществлять обмен АНИ в электронном виде;
                        </li>
                        <li>внедрить систему качества (менеджмента) в систему обработки аэронавигационной информации,
                            совершенствовать процедуры и процессы управления качеством на каждой функциональной стадии
                            обработки
                            аэронавигационных данных от аэропорта через предприятия, осуществляющие деятельность в
                            области
                            аэронавигационной информации, до потребителя;
                        </li>
                        <li>создать корпоративную электронную сеть для функционирования автоматизированной системы
                            сбора,
                            обработки, хранения и распространения АНИ;
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <ul>
                        <li>создать федеральную электронную базу данных АНИ, предусмотрев ее защиту от
                            несанкционированного
                            доступа;
                        </li>
                        <li>осуществлять контроль за качеством вносимых в структуру воздушного пространства изменений,
                            до их
                            опубликования в государственных документах АНИ;
                        </li>
                        <li>совершенствовать порядок обеспечения АНИ пользователей воздушного пространства с учетом
                            Стандартов и
                            Рекомендуемой практики ИКАО;
                        </li>
                        <li>разработать концепцию развития системы обеспечения АНИ в свете внедрения программы CNS/ATM в
                            отечественную практику;
                        </li>
                        <li>разработать порядок обеспечения государственной АНИ пользователей воздушного пространства,
                            осуществляющих свою деятельность при уведомительном порядке использования воздушного
                            пространства;
                        </li>
                        <li>создать механизм финансирования сбора, обработки, хранения и распространения государственной
                            АНИ,
                            ведения федеральной электронной базы данных АНИ;
                        </li>
                        <li>публиковать государственную АНИ в Сборнике аэронавигационной информации (АИП России) в
                            формате,
                            соответствующем Стандартам и Рекомендуемой практике ИКАО. При этом государственная АНИ на
                            региональном уровне должна публиковаться в соответствующих документах АНИ;
                        </li>
                        <li>разработать единые требования к профессиональной подготовке и переподготовки персонала
                            органов АНИ,
                            в том числе и по ускоренным программам.
                        </li>
                    </ul>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <p>
                        С целью устранения перечисленных проблем, Росаэронавигацией (Росавиация на текщее время)
                        подготовлены
                        изменения в Воздушный кодекс Российской Федерации, которые 20 августа 2007 г. одобрены на
                        заседании
                        Комиссии Правительства Российской Федерации по законопроектной деятельности.
                    </p>
                    <p id="createSystem">
                        Создание распределенной системы сбора, хранения и распространения аэронавигационных данных на
                        базе
                        глобальных сетевых технологий решает выдвинутые задачи и результат совпадает с изменениями
                        подготовленными Росаэронавигацией (Росавиацией) 20 августа 2007 г. одобрены на заседании
                        Комиссии
                        Правительства Российской Федерации по законопроектной деятельности.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <h2>Основные результаты и выводы</h2>

                    <p>Результаты по главы 1:</p>
                    <ul>
                        <li>Проведён анализ современного состояния и перспектив развития системы обеспечения
                            аэронавигационной
                            информации ЕС ОрВД.
                        </li>
                        <li>Проанализирован Глобальный аэронавигационный план в частности аэронавигационного
                            обеспечения.
                        </li>
                        <li>Определены стратегические направляющие для обеспечения непрерывного усовершенствования
                            системы
                            обеспечения аэронавигационной информации с точки зрения качества, своевременности и
                            выявления новых
                            видов услуг и информационных продуктов в целях повышения уровня обслуживания авиационных
                            пользователей.
                        </li>
                        <li>Сформулирована цель и определены основные задачи исследования.</li>
                    </ul>

                    <p>
                        <b>Полученные результаты позволяют сделать следующие выводы:</b>
                        В ходе анализа перспектив развития системы обеспечения аэронавигационной информации РФ
                        установлено, что
                        в качестве основополагающего направления развития системы выбрано направление создания
                        распределенной
                        системы сбора, хранения и распространения аэронавигационных данных на базе глобальных сетевых
                        технологий. Такой подход соответствует всем предъявленным рекомендациям и требованиям как
                        аэронавигационного совета (Коллегии) Федеральной аэронавигационной службы РФ, так и концепции
                        глобального аэронавигационного плана ИКАО.
                    </p>
                </div>
            </slide>
            <slide class="slide">
                <div class="container">
                    <br><br><br><br><br><br><br>
                    <a target="_blank"
                       href="https://docs.google.com/document/d/1dEQVxG_XnzwwKR1RPAeRMfVOUn410m7pqBPrpnTxjVU/edit?usp=sharing">
                        Полный текст Главы 1
                    </a>
                </div>
            </slide>
        </carousel>
    </div>
</template>

<script>
  import { Carousel, Slide } from 'vue-carousel'

  export default {
    name: 'Chapter1',
    components: {
      Carousel,
      Slide
    },
    mounted () {
      let locat = window.location.toString()
      // alert(locat.indexOf('createSystem'))
      if (locat.indexOf('createSystem') !== -1) {
        document.getElementById('createSystem').scrollIntoView(true)
        window.scrollBy(0, -60)
      }
    },
    data () {
      return {
        options: {}
      }
    }
  }
</script>

<style scoped>

</style>
