<template>
    <div>
        <carousel :per-page="1" paginationActiveColor="#42b983" paginationColor="#b2ebd1" :paginationSize="11">
            <slide class="slide">
                <div class="container">
                    <h1>
                        Метод оптимизации процесса производства документов аэронавигационной информации
                    </h1>
                    <h2>
                        Аннотация
                    </h2>
                    <p>
                        В этой статье представлена методология оптимизации процесса производства документов аэронавигационной
                        информации, базирующаяся на моделировании Системы Массового Обслуживания (далее СМО). Рассмотрены
                        многофазные системы массового обслуживания, как базис для изучаемых процессов. Язык программирования
                        Golang и параллельные вычисления в данном исследовании выступают как основные инструменты для
                        реализации имитационных моделей. Предоставляется программный код и результаты стохастического
                        моделирования.
                    </p>
                    <h2>
                        1. Моделирование случайных величин и распределений на языке <b>Golang</b>
                    </h2>
                    <p>
                        Рассмотрим простейшие модели на примере подбрасывали одного и нескольких кубиков для игры в кости.
                        Эти модели затронут вероятностные распределения, а также инструментарий параллельных вычислений для
                        моделирования.
                    </p>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        1.1. Модель подбрасывания одного кубика
                    </h3>
                    <p>
                        Программный код модели представлен на листинге 1.
                        Результат моделирования представлен представлен на рисунке 1.
                    </p>
                    <div class="bar-place">
                        <BarOneDice />
                    </div>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        1.2. Модель подбрасывания двух кубиков
                    </h3>
                    <p>
                        Программный код модели представлен на листинге 2.
                        Результат моделирования представлен представлен на рисунке 2.
                    </p>
                    <div class="bar-place">
                        <div class="bar-place">
                            <BarTwoDice />
                        </div>
                    </div>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        1.3. Модель нормального распределения
                    </h3>
                    <p>
                        Задача, на данном этапе, показать как предыдущий случай с несколькими
                        кубиками коррелирует с нормальным распределением.
                        Программный код модели представлен на листинге 3.
                        Результат моделирования представлен представлен на рисунке 3.
                    </p>
                    <div class="bar-place">
                        <BarNormalDistribution />
                    </div>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        1.4. Модель экспоненциального распределения
                    </h3>
                    <p>
                        Финальным шагом является демонстрация экспоненциального распределения.
                        Экспоненциальное распределение используется для моделирования распределения
                        (длительности) интервалов между моментами поступления требований в СМО разного
                        типа.
                        Программный код модели представлен на листинге 4.
                        Результат моделирования представлен представлен на рисунке 4.
                    </p>
                    <div class="bar-place">
                        <BarExponentialDistribution />
                        <!--<Bar v-bind:data="[0, 160, 80, 60, 62, 40, 25, 10, 12, 9, 8, 2, 4]"-->
                             <!--v-bind:labels="['0', '.05', '.1', '.15', '.2', '.25', '.3', '.35', '.4', '.45', '.5', '.55', '.6']"/>-->
                    </div>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>1.5. Стохастическое моделирование</h3>
                    <p>
                        Метод Монте-Карло и СМО М/М/1 [расписать подробнее]
                    </p>
                    <p>
                        Программный код модели представлен на листинге 5.
                        Результат моделирования представлен представлен на рисунке 5.
                    </p>
                    <div class="bar-place">
                        <!--<Bar v-bind:data="[0, 0.0004, 0.0006, 0.004, 0.010, 0.016, 0.012, 0.002, 0.0006, 0.0001, 0]"-->
                             <!--v-bind:labels="['550', '600', '625', '650', '675', '700', '725', '750', '775', '800', '825']"/>-->
                    </div>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h2>
                        2. Метод оптимизации процесса производства документов аэронавигационной информации на основе
                        моделирования многофазной системы массового обслуживания упрощенной схемы циркуляции аэронавигационных документов
                        между ЦАИ и региональными САИ.
                    </h2>
                    <p>
                        Информации по СМО полно читать там [ссылки]. Почему многофазные? Описать точки соприкосновения
                        текущей системы аэронавигационной информации с моделируемыми СМО КРАТКО
                    </p>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        2.1. Модель расширенного нормального распределения с помощью горутин
                    </h3>
                    <p>
                        Метод Монте-Карло и СМО М/М/1 [расписать подробнее]. Задача: нормальное распределение со следующими
                        характеристиками: кубиков: 200 штук, число попыток: 150000 попыток. Основная идея - использование
                        <b>горутин</b>. Программный код модели представлен на листинге 6. Результат моделирования представлен
                        представлен на рисунке 6.
                    </p>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        2.2. Имитационная модель упрощённой схемы циркуляции аэронавигационных документов между ЦАИ и
                        региональными САИ
                    </h3>
                    <p>
                        Описание имитационной модели.
                    </p>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        2.3. Статистическая модель упущенной схемы циркуляции аэронавигационных документов между ЦАИ и
                        региональными САИ
                    </h3>
                    <p>
                        Описание статистической модели.
                    </p>
                </div>
            </slide>

            <slide class="slide">
                <div class="container">
                    <h3>
                        2.3. Статистическая модель упущенной схемы циркуляции аэронавигационных документов между ЦАИ и
                        региональными САИ
                    </h3>
                    <p>
                        Описание статистической модели.
                    </p>
                </div>
            </slide>

        </carousel>
    </div>
</template>

<script>
  import { Carousel, Slide } from 'vue-carousel'

  import BarOneDice from '@/components/BarOneDice'
  import BarTwoDice from '@/components/BarTwoDice'
  import BarNormalDistribution from '@/components/BarNormalDistribution'
  import BarExponentialDistribution from '@/components/BarExponentialDistribution'

  export default {
    name: 'Publication1',
    components: {
      Carousel,
      Slide,
      BarOneDice,
      BarTwoDice,
      BarNormalDistribution,
      BarExponentialDistribution
    }
  }
</script>

<style lang="scss" scoped>
    .slide {
    }

    .container {
        max-width: 1280px;
        padding: 10px;
        margin: auto;
    }

    p {
        text-indent: 1.5em;
        text-align: justify;
        line-height: 1.4em;
    }

    .bar-place {
        width: 450px;
        margin: 50px auto 50px auto;
    }
</style>
