<template>
    <div class="fullpage-container">
        <div class="fullpage-wp" v-fullpage="options" ref="fullscroll">
            <div class="page container">
                <h1>
                    Метод оптимизации процесса производства документов аэронавигационной информации
                </h1>
                <h2>
                    Аннотация
                </h2>
                <p>
                    В этой статье представлена методология оптимизации процесса производства документов аэронавигационной
                    информации, базирующаяся на моделировании Системы Массового Обслуживания (далее СМО). Рассмотрены
                    многофазные системы массового обслуживания, как базис для изучаемых процессов. Язык программирования
                    Golang и параллельные вычисления в данном исследовании выступают как основные инструменты для
                    реализации имитационных моделей. Предоставляется программный код и результаты стохастического
                    моделирования.
                </p>
                <h2>
                    1. Моделирование случайных величин и распределений на языке <b>Golang</b>
                </h2>
                <p>
                    Рассмотрим простейшие модели на примере подбрасывали одного и нескольких кубиков для игры в кости.
                    Эти модели затронут вероятностные распределения, а также инструментарий параллельных вычислений для
                    моделирования.
                </p>
            </div>

            <div class="page container">
                <h3>
                    1.1. Модель подбрасывания одного кубика
                </h3>
                <p>
                    Программный код модели представлен на листинге 1.
                    Результат моделирования представлен представлен на рисунке 1.
                </p>
                <div class="bar-place">
                    <BarOneDice />
                </div>
            </div>

            <div class="page container">
                <h3>
                    1.2. Модель подбрасывания двух кубиков
                </h3>
                <p>
                    Программный код модели представлен на листинге 2.
                    Результат моделирования представлен представлен на рисунке 2.
                </p>
                <div class="bar-place">
                    <!--<Bar v-bind:data="[0, 0, 10, 20, 30, 40, 50, 55, 50, 35, 23, 18, 6]"-->
                         <!--v-bind:labels="['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']"/>-->
                </div>
            </div>

            <div class="page container">
                <h3>
                    1.3. Модель нормального распределения
                </h3>
                <p>
                    Программный код модели представлен на листинге 3.
                    Результат моделирования представлен представлен на рисунке 3.
                </p>
                <div class="bar-place">
                    <!--<Bar v-bind:data="[0, 0, 6, 18, 33, 44, 49, 51, 50, 37, 21, 20, 8]"-->
                         <!--v-bind:labels="['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12']"/>-->
                </div>
            </div>

            <div class="page container">
                <h3>
                    1.4. Модель экспоненциального распределения
                </h3>
                <p>
                    Программный код модели представлен на листинге 4.
                    Результат моделирования представлен представлен на рисунке 4.
                </p>
                <div class="bar-place">
                    <!--<Bar v-bind:data="[0, 160, 80, 60, 62, 40, 25, 10, 12, 9, 8, 2, 4]"-->
                         <!--v-bind:labels="['0', '.05', '.1', '.15', '.2', '.25', '.3', '.35', '.4', '.45', '.5', '.55', '.6']"/>-->
                </div>
            </div>

            <div class="page container">
                <h3>
                1.5. Стохастическое моделирование
            </h3>
                <p>
                    Метод Монте-Карло и СМО М/М/1 [расписать подробнее]
                </p>
                <p>
                    Программный код модели представлен на листинге 5.
                    Результат моделирования представлен представлен на рисунке 5.
                </p>
                <div class="bar-place">
                    <!--<Bar v-bind:data="[0, 0.0004, 0.0006, 0.004, 0.010, 0.016, 0.012, 0.002, 0.0006, 0.0001, 0]"-->
                         <!--v-bind:labels="['550', '600', '625', '650', '675', '700', '725', '750', '775', '800', '825']"/>-->
                </div>
            </div>

            <div class="page container">
                <h2>
                    2. Метод оптимизации процесса производства документов аэронавигационной информации на основе
                    моделирования многофазной системы массового обслуживания упрощенной схемы циркуляции аэронавигационных документов
                    между ЦАИ и региональными САИ.
                </h2>
                <p>
                    Информации по СМО полно читать там [ссылки]. Почему многофазные? Описать точки соприкосновения
                    текущей системы аэронавигационной информации с моделируемыми СМО КРАТКО
                </p>
            </div>

            <div class="page container">
                <h3>
                    2.1. Модель расширенного нормального распределения с помощью горутин
                </h3>
                <p>
                    Метод Монте-Карло и СМО М/М/1 [расписать подробнее]. Задача: нормальное распределение со следующими
                    характеристиками: кубиков: 200 штук, число попыток: 150000 попыток. Основная идея - использование
                    <b>горутин</b>. Программный код модели представлен на листинге 6. Результат моделирования представлен
                    представлен на рисунке 6.
                </p>
            </div>

            <div class="page container">
                <h3>
                    2.2. Имитационная модель упрощённой схемы циркуляции аэронавигационных документов между ЦАИ и
                    региональными САИ
                </h3>
                <p>
                    Описание имитационной модели.
                </p>
            </div>

            <div class="page container">
                <h3>
                    2.3. Статистическая модель упущенной схемы циркуляции аэронавигационных документов между ЦАИ и
                    региональными САИ
                </h3>
                <p>
                    Описание статистической модели.
                </p>
            </div>

            <div class="page container">
                <div class="page container">
                    <h3>
                        2.3. Статистическая модель упущенной схемы циркуляции аэронавигационных документов между ЦАИ и
                        региональными САИ
                    </h3>
                    <p>
                        Описание статистической модели.
                    </p>
                </div>
            </div>

        </div>
        <div class="prev" @click="movePrev"></div>
        <div class="next" @click="moveNext"></div>
    </div>
</template>

<script>
  import BarOneDice from '../components/BarOneDice'

  export default {
    name: 'Publication1',
    components: {
      BarOneDice
    },
    data () {
      return {
        options: {
          start: 0,
          dir: 'v',
          duration: 20
        }
      }
    },
    methods: {
      moveNext () {
        this.$refs.fullscroll.$fullpage.moveNext() // Move to the next page
      },
      movePrev () {
        this.$refs.fullscroll.$fullpage.movePrev() // Move to the next page
      }
    }
  }
</script>

<style scoped>
    .fullpage-container {
        position: absolute;
        left: 0;
        top: 50px;
        width: 100%;
        height: calc(100vh - 50px);
    }

    .container {
        max-width: 1280px;
        margin: auto;
    }

    .prev {
        position: absolute;
        bottom: 30px;
        right: 70px;
        display: inline-block;
        width: 32px;
        height: 32px;
        background: url('../../src/assets/up.svg') no-repeat center center;
        margin: 5px;
        opacity: .5;
        cursor: pointer;
    }
    .prev:hover {
        opacity: 1;
    }

    .next {
        position: absolute;
        bottom: 30px;
        right: 30px;
        display: inline-block;
        width: 32px;
        height: 32px;
        background: url('../../src/assets/down.svg') no-repeat center center;
        opacity: .5;
        margin: 5px;
        cursor: pointer;
    }
    .next:hover {
        opacity: 1;
    }

    p {
        text-indent: 1.5em;
        text-align: justify;
        line-height: 1.4em;
    }

    .bar-place {
        width: 450px;
        margin: 50px auto 50px auto;
    }
</style>
